# Element Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabel..::..Element Property
AlignmentStationLabel Class See Also
---
The underlying SpotDimension element.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public Element Element { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Element As Element
	Get
```

Visual C++
---
```text
public:
property Element^ Element {
	Element^ get ();
}
```

# See Also
AlignmentStationLabel Class
Autodesk.Revit.DB.Infrastructure Namespace